Revit 2027 API
Connector.AssignedPressureDrop Property
The assigned pressure drop of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AssignedPressureDrop { get; set; }
Public Property AssignedPressureDrop As Double
	Get
	Set
public:
property double AssignedPressureDrop {
	double get ();
	void set (double value);
}
member AssignedPressureDrop : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the connector is not in a family instance. Thrown when the connector's domain is not DomainHvac or DomainPiping.
ArgumentException |  Thrown when set an invalid value.
InvalidOperationException |  Thrown on failure to get or set assigned pressure drop.
Remarks
Assigned pressure drop may be assigned for connectors of some family instances. In order to set this property, it must be mapped to a writable instance parameter in the family definition.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace